Revit 2027 API
BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch Property
 The bend profile cannot contain a closed loop. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BentFabricSheetClosedLoopInSketch { get; }
Public Shared ReadOnly Property BentFabricSheetClosedLoopInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BentFabricSheetClosedLoopInSketch {
	FailureDefinitionId^ get ();
}
static member BentFabricSheetClosedLoopInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace